Examinator/src/Enums/ВариантыОформленияКомандыПрофиляВебКабинетаСУО/ВариантыОформленияКомандыПрофиляВебКабинетаСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыОформленияКомандыПрофиляВебКабинетаСУО</name>
  <enumValues>
    <name>Фотография</name>
  </enumValues>
  <enumValues>
    <name>ИмяДляВходаИФотография</name>
  </enumValues>
  <enumValues>
    <name>ПолноеИмяИАватар</name>
  </enumValues>
  <enumValues>
    <name>ПолноеИмя</name>
  </enumValues>
  <enumValues>
    <name>ИмяДляВхода</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ВариантыОформленияКомандыПрофиляВебКабинетаСУО/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция ЗначениеВТекст(Вариант) Экспорт
	
	Если Вариант = Перечисления.ВариантыОформленияКомандыПрофиляВебКабинетаСУО.ИмяДляВхода Тогда
		Возврат "login";
	КонецЕсли;
	
	Если Вариант = Перечисления.ВариантыОформленияКомандыПрофиляВебКабинетаСУО.ИмяДляВходаИФотография Тогда
		Возврат "loginAndPhoto";
	КонецЕсли;
	
	Если Вариант = Перечисления.ВариантыОформленияКомандыПрофиляВебКабинетаСУО.ПолноеИмя Тогда
		Возврат "name";
	КонецЕсли;
	
	Если Вариант = Перечисления.ВариантыОформленияКомандыПрофиляВебКабинетаСУО.ПолноеИмяИАватар Тогда
		Возврат "nameAndPhoto";
	КонецЕсли;
	
	Если Вариант = Перечисления.ВариантыОформленияКомандыПрофиляВебКабинетаСУО.Фотография Тогда
		Возврат "photo";
	КонецЕсли;
	
	Возврат "photo";
	
КонецФункции

#КонецОбласти

#КонецЕсли
